/*
Библиотечка

Собрать библиотеку для обработки массивов на основе реализованных вами функций.
Обеспечить максимально возможное повторное использование кода, т.е. не
дублировать функционал. Подключить все необходимые библиотеки.
Отделить заголовки от реализации. Получить на выходе два файла - заголовок и
реализацию.

Пример использования:
gcc -std=c99 array.c -c -o array.o
gcc -std=c99 main.c array.o -o array.exe
array.exe

Ожидаемый результат:
EPIC WIN

Нет, код main.c я не покажу. Нет, ничего, выходящего за рамки задач в Бендере
не требуется. Да, в main.c подключается array.h
*/
