/*
Список (динамический массив)
На основе известных вам инструментов реализовать необходимый функционал для
работы со списком:
* добавление одного элемента в конец
* добавление одного элемента по произвольном индексу (список при этом также
расширяется)
* добавление (копирование) заданного количества элементов из массива в конец
списка
* удаление последнего элемента
* удаление заданного количества последних элементов
* "обрезание" списка до заданной длины

Бонус:
* оптимизация производительности за счет заблаговременного расширения списка на
заданный шаг / с заданным коэффицентом. Т.е. при добавлении нового элемента в
конец списка при необходимости его объем увеличивается на заданную величину / в
заданное число раз.
* аналогичная оптимизация при удалении элемента.
*/
