/*
Задача hello

Условие задачи
Поприветствовать Бендера.

Пример вывода
Hello, Bender!

epic win
*/

#include <stdio.h>

int main() {
    printf("Hello, Bender!\n");
    return 0;
}
